// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так  виведіть повідомлення 'Вірно' у alert().
//    Якщо ні  виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

const number = Number(prompt('Введіть число'));
if(number === 10) {
    alert('Вірно');
} else {
    alert('Невірно');
}


// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);

const min = Math.floor(Math.random() * 59);
if(min >= 0 && min <=14) {
    alert(`${min}  входить в першу чверть`);
} else if(min >= 15 && min <= 29) {
    alert(`${min}  входить в першу чверть`);
}
